## Übungen zur Lektion 1: Select mit der cia-Datenbank

In [2]:
import pandas as pd
import sqlite3
con = sqlite3.connect('../../data/cia.db')
df = pd.read_sql("SELECT * FROM cia", con)
len(df)

235

## Aufgaben

Aufgabe 1. Gib alle Daten der Tabelle 'cia' aus.

In [7]:
df[df.Name < "M"][["Name"]]

                           Name
0                   Afghanistan
1                      Albanien
2                      Algerien
3    Amerikanische Samoa-Inseln
4                       Andorra
..                          ...
122               Liechtenstein
123                     Litauen
124                   Luxemburg
221             Groß-Britannien
232                       Jemen

[117 rows x 1 columns]

Aufgabe 2: Gib die Namen aller Länder aus.

Aufgabe 3: Gib alle Länder an, die mehr als 100 Millionen (1E08) Einwohner haben.

Aufgabe 4: Gib die Länder an, die ein Bruttosozialprodukt (BIP) zwischen 1 und 100 Milliarden haben und in Asien liegen.

In [6]:
df[["Name"]] [  (df.BIP.between(1E9, 100E9))  & (df.Region == "Asien")   ]

            Name
0    Afghanistan
24        Bhutan
112  Korea, Nord
143     Mongolei
149        Nepal
197    Sri Lanka

Aufgabe 5: Gib die Einwohnerzahlen für Frankreich, Deutschland und Polen aus.

In [7]:
 df[["Name", "Einwohner in Mio"]] [ df.Name.str.contains("Frankreich|Deutschland|Polen", regex=True)   ] #  "Frankreich|Deutschland|Polen"

            Name  Einwohner in Mio
72    Frankreich             59.33
79   Deutschland             82.80
170        Polen             38.65

In [8]:
df[["Name", "Einwohner in Mio"]][(df["Name"] == "Deutschland") | (df["Name"] =="Polen")]

            Name  Einwohner in Mio
79   Deutschland             82.80
170        Polen             38.65

Aufgabe 6. Zeige Name und Einwohnerzahl in Millionen für die Länder Südamerikas.

In [11]:
df[df["Region"]=="Südamerika"][["Name", "Einwohner in Mio"]].sort_values(by= "Einwohner in Mio", ascending = False)

                                  Name  Einwohner in Mio
28                           Brasilien            172.86
46                           Kolumbien             39.69
9                          Argentinien             36.96
167                               Peru             27.01
226                          Venezuela             23.54
42                               Chile             15.15
61                             Ecuador             12.92
25                            Bolivien              8.15
166                           Paraguay              5.59
223                            Uruguay              3.33
91                              Guyana              0.70
199                           Suriname              0.43
73                 Französisch-Guayana              0.17
68   Falkland Islands (Islas Malvinas)              0.00

Aufgabe 7. Gib die Namen und das pro Kopf-Jahreseinkommen der Länder mit mehr als 200 Millionen Einwohnern aus.

In [13]:
x = df[["Name", "BIP"]][df["Einwohner"] >= 200E6]
x["Pro Kopf"] = df.BIP / df.Einwohner
x

                               Name           BIP      Pro Kopf
43                            China  4.800000e+12   3803.991472
98                           Indien  1.805000e+12   1780.072195
99                       Indonesien  6.100000e+11   2713.713744
222  Vereinigte Staaten von Amerika  9.255000e+12  33585.826045

Aufgabe 8. Wie vorherige Aufgabe, allerdings sollen die Ergebnisse absteigend nach dem pro Kopf Jahreseinkommen sortiert werden.

In [14]:
x.sort_values(by='Pro Kopf', ascending= False)

                               Name           BIP      Pro Kopf
222  Vereinigte Staaten von Amerika  9.255000e+12  33585.826045
43                            China  4.800000e+12   3803.991472
99                       Indonesien  6.100000e+11   2713.713744
98                           Indien  1.805000e+12   1780.072195

Aufgabe 9. In welchen Ländernamen kommt das Wort 'Vereinigte' vor?

In [18]:
df[df['Name'].str.contains('vereinigte',case = False)]

,LID,Name,Region,Flaeche,Einwohner,BIP,Einwohner in Mio
220,221,Vereinigte Arabische Emirate,Mittlerer Osten,82880,2369153.0,4.150000e+10,2.37
222,223,Vereinigte Staaten von Amerika,Nordamerika,9629091,275562673.0,9.255000e+12,275.56

Aufgabe 10. Lasse Dir in alphabetischer Reihenfolge alle verschiedenen Regionen anzeigen.

In [61]:
pd.DataFrame(df.sort_values(by = 'Region', ascending = True)['Region'].unique())

                  0
0            Afrika
1         Antarktis
2     Arktik-Region
3             Asien
4            Europa
5     Mittelamerika
6   Mittlerer Osten
7       Nordamerika
8         Osteuropa
9          Ozeanien
10       Südamerika
11      Südostasien
12             Welt

Aufgabe 11. Zeige alle Länder, bei denen das Bruttoinlandsprodukt unbekannt ist.

In [86]:
df[["Name","BIP"]] [ df.BIP.isnull() ]

                                  Name  BIP
7                            Antarktik  NaN
44                    Christmas Island  NaN
45            Cocos )(Keeling) Islands  NaN
68   Falkland Islands (Islas Malvinas)  NaN
81                           Gibraltar  NaN
93                       Vatikan Stadt  NaN
158                     Norfolk Island  NaN
169                   Pitcairn Islands  NaN
200                           Svalbard  NaN
231                   Westliche Sahara  NaN